openfoam-cases/cylinder-zerofluid-dt0p002/Cylinder-zero-fluid-Symplectic/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "300";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
19175
(
-2.963e-06
5.00789e-05
-4.71159e-05
-6.32776e-06
0.00013818
-0.000134815
-2.32748e-06
0.000216081
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.170641
0.17062
0.171019
0.171818
0.172985
0.174507
0.176381
0.178612
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
