openfoam-cases/cylinder-zerofluid-dt0p002/Cylinder-zero-fluid-Symplectic/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    cylinder
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    top
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    bottom
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}

